In [7]:
#np.random.randn(4,3) 4*3的隨機數字。DataFrame改成表格。columns改欄。index改列
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randn(4,3),
             columns=['b','d','e'],
             index=['台北','台中','台南','高雄'])
df1

           b         d         e
台北 -0.875910  0.666223 -0.795374
台中  0.359580 -0.219854  1.457433
台南  1.350223 -0.622042  0.196802
高雄  1.757688 -0.684071 -0.994839

In [8]:
#改成正數
#numpy的function
np.abs(df1)

           b         d         e
台北  0.875910  0.666223  0.795374
台中  0.359580  0.219854  1.457433
台南  1.350223  0.622042  0.196802
高雄  1.757688  0.684071  0.994839

In [9]:
#使用實體方法
df1.abs()

           b         d         e
台北  0.875910  0.666223  0.795374
台中  0.359580  0.219854  1.457433
台南  1.350223  0.622042  0.196802
高雄  1.757688  0.684071  0.994839

In [18]:
display(df1['b'])
display(df1[['b']])

from pandas import Series
def fun1(value:Series)->float:
    return value.max() - value.min()

df1[['b']].apply(fun1)

台北   -0.875910
台中    0.359580
台南    1.350223
高雄    1.757688
Name: b, dtype: float64

           b
台北 -0.875910
台中  0.359580
台南  1.350223
高雄  1.757688

b    2.633597
dtype: float64

In [19]:
df1.apply(fun1)

b    2.633597
d    1.350294
e    2.452272
dtype: float64

In [20]:
df1.apply(fun1,axis=1)

台北    1.542132
台中    1.677287
台南    1.972265
高雄    2.752527
dtype: float64

In [21]:
df1

           b         d         e
台北 -0.875910  0.666223 -0.795374
台中  0.359580 -0.219854  1.457433
台南  1.350223 -0.622042  0.196802
高雄  1.757688 -0.684071 -0.994839

In [22]:
def fun2(value:Series)->Series:
    return pd.Series([value.max(),value.min()],index=['最大','最小'])

df1.apply(fun2)

           b         d         e
最大  1.757688  0.666223  1.457433
最小 -0.875910 -0.684071 -0.994839

In [23]:
df1.apply(fun2,axis=1)

          最大        最小
台北  0.666223 -0.875910
台中  1.457433 -0.219854
台南  1.350223 -0.622042
高雄  1.757688 -0.994839